examples/of7/system/fvSchemes
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

// Gradient terms
gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}

// Convection terms
divSchemes
{
    default                             none;

    div(phi,U)                          bounded Gauss linearUpwind limited;
    // div(phi,U)                          bounded Gauss linearUpwindV grad(U); //more stable but arguably less accurate
    div(phi,k)                          Gauss upwind;
    div(phi,epsilon)                    Gauss upwind;

    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
}

// Diffusive terms
laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
